Revit 2027 API
Element.GetPhaseStatus Method
 Gets the status of a given element in the input phase
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementOnPhaseStatus GetPhaseStatus(
	ElementId phaseId
)
Public Function GetPhaseStatus (
	phaseId As ElementId
) As ElementOnPhaseStatus
public:
ElementOnPhaseStatus GetPhaseStatus(
	ElementId^ phaseId
)
member GetPhaseStatus :
        phaseId : ElementId -> ElementOnPhaseStatus
Parameters
phaseId ElementId
 Id of the phase.
Return Value
ElementOnPhaseStatus
 The status of the element in the phase.
Exceptions
Exception | Condition
ArgumentException |  The id does not represent a valid phase.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace